mtest> mtreset 190

mtest> mtnew 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 1
* Free mem in last block: 72
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---
ooo
Array list ---


mtest> mtdel -r 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 1
* Free mem in last block: 72
* Recycle list          : 
[  0] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---


mtest> mtnew 5 -a 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 6
* Free mem in last block: 72
* Recycle list          : 
[  0] = 2         [  1] = 5         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
ooooo

mtest> mtdel -r 2 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 6
* Free mem in last block: 72
* Recycle list          : 
[  0] = 2         [  1] = 5         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxx

mtest> mtnew -a 2 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 8
* Free mem in last block: 112
* Recycle list          : 
[  0] = 2         [  1] = 6         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxooo

mtest> mtnew -a 5 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 11
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  2] = 1         [  3] = 2         

=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxoooooo

mtest> mtnew -a 7 2

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 11
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  2] = 1         [  3] = 2         

=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
oooxxoooooo

mtest> mtdel -r 8 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 11
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  2] = 3         [  3] = 3         
[  5] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
ooxxxxxoxoo

mtest> mtdel -r 9 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 11
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  2] = 4         [  3] = 5         
[  5] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
xxxxxxxxxox

mtest> mtdel -i 8 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 11
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  2] = 4         [  3] = 5         
[  5] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
xxxxxxxxxox

mtest> mtdel -i 12 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 11
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  2] = 4         [  3] = 5         
[  5] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxx
Array list ---
xxxxxxxxxox

mtest> q -f

